RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/cyble_416045_02_device.h
/*******************************************************************************
*                                   SMARTIO
*******************************************************************************/

#define SMARTIO_BASE                            0x40330000UL
#define SMARTIO                                 ((SMARTIO_Type*) SMARTIO_BASE)                                    /* 0x40330000 */
#define SMARTIO_PRT8                            ((SMARTIO_PRT_Type*) &SMARTIO->PRT[8])                            /* 0x40330800 */
#define SMARTIO_PRT9                            ((SMARTIO_PRT_Type*) &SMARTIO->PRT[9])                            /* 0x40330900 */

/*******************************************************************************
*                                     UDB
*******************************************************************************/

#define UDB_BASE                                0x40340000UL
#define UDB                                     ((UDB_Type*) UDB_BASE)                                            /* 0x40340000 */
#define UDB_WRKONE                              ((UDB_WRKONE_Type*) &UDB->WRKONE)                                 /* 0x40340000 */
#define UDB_WRKMULT                             ((UDB_WRKMULT_Type*) &UDB->WRKMULT)                               /* 0x40341000 */
#define UDB_UDBPAIR0                            ((UDB_UDBPAIR_Type*) &UDB->UDBPAIR[0])                            /* 0x40342000 */
#define UDB_UDBPAIR1                            ((UDB_UDBPAIR_Type*) &UDB->UDBPAIR[1])                            /* 0x40342200 */
#define UDB_UDBPAIR2                            ((UDB_UDBPAIR_Type*) &UDB->UDBPAIR[2])                            /* 0x40342400 */
#define UDB_UDBPAIR3                            ((UDB_UDBPAIR_Type*) &UDB->UDBPAIR[3])                            /* 0x40342600 */
#define UDB_UDBPAIR4                            ((UDB_UDBPAIR_Type*) &UDB->UDBPAIR[4])                            /* 0x40342800 */
#define UDB_UDBPAIR5                            ((UDB_UDBPAIR_Type*) &UDB->UDBPAIR[5])                            /* 0x40342A00 */
#define UDB_UDBPAIR0_UDBSNG0                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[0].UDBSNG[0])           /* 0x40342000 */
#define UDB_UDBPAIR0_UDBSNG1                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[0].UDBSNG[1])           /* 0x40342080 */
#define UDB_UDBPAIR1_UDBSNG0                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[1].UDBSNG[0])           /* 0x40342200 */
#define UDB_UDBPAIR1_UDBSNG1                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[1].UDBSNG[1])           /* 0x40342280 */
#define UDB_UDBPAIR2_UDBSNG0                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[2].UDBSNG[0])           /* 0x40342400 */
#define UDB_UDBPAIR2_UDBSNG1                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[2].UDBSNG[1])           /* 0x40342480 */
#define UDB_UDBPAIR3_UDBSNG0                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[3].UDBSNG[0])           /* 0x40342600 */
#define UDB_UDBPAIR3_UDBSNG1                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[3].UDBSNG[1])           /* 0x40342680 */
#define UDB_UDBPAIR4_UDBSNG0                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[4].UDBSNG[0])           /* 0x40342800 */
#define UDB_UDBPAIR4_UDBSNG1                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[4].UDBSNG[1])           /* 0x40342880 */
#define UDB_UDBPAIR5_UDBSNG0                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[5].UDBSNG[0])           /* 0x40342A00 */
#define UDB_UDBPAIR5_UDBSNG1                    ((UDB_UDBPAIR_UDBSNG_Type*) &UDB->UDBPAIR[5].UDBSNG[1])           /* 0x40342A80 */
#define UDB_UDBPAIR0_ROUTE                      ((UDB_UDBPAIR_ROUTE_Type*) &UDB->UDBPAIR[0].ROUTE)                /* 0x40342100 */
#define UDB_UDBPAIR1_ROUTE                      ((UDB_UDBPAIR_ROUTE_Type*) &UDB->UDBPAIR[1].ROUTE)                /* 0x40342300 */
#define UDB_UDBPAIR2_ROUTE                      ((UDB_UDBPAIR_ROUTE_Type*) &UDB->UDBPAIR[2].ROUTE)                /* 0x40342500 */
#define UDB_UDBPAIR3_ROUTE                      ((UDB_UDBPAIR_ROUTE_Type*) &UDB->UDBPAIR[3].ROUTE)                /* 0x40342700 */
#define UDB_UDBPAIR4_ROUTE                      ((UDB_UDBPAIR_ROUTE_Type*) &UDB->UDBPAIR[4].ROUTE)                /* 0x40342900 */
#define UDB_UDBPAIR5_ROUTE                      ((UDB_UDBPAIR_ROUTE_Type*) &UDB->UDBPAIR[5].ROUTE)                /* 0x40342B00 */
#define UDB_DSI0                                ((UDB_DSI_Type*) &UDB->DSI[0])                                    /* 0x40346000 */
#define UDB_DSI1                                ((UDB_DSI_Type*) &UDB->DSI[1])                                    /* 0x40346080 */
#define UDB_DSI2                                ((UDB_DSI_Type*) &UDB->DSI[2])                                    /* 0x40346100 */
#define UDB_DSI3                                ((UDB_DSI_Type*) &UDB->DSI[3])                                    /* 0x40346180 */
#define UDB_DSI4                                ((UDB_DSI_Type*) &UDB->DSI[4])                                    /* 0x40346200 */
#define UDB_DSI5                                ((UDB_DSI_Type*) &UDB->DSI[5])                                    /* 0x40346280 */
#define UDB_DSI6                                ((UDB_DSI_Type*) &UDB->DSI[6])                                    /* 0x40346300 */
#define UDB_DSI7                                ((UDB_DSI_Type*) &UDB->DSI[7])                                    /* 0x40346380 */
#define UDB_DSI8                                ((UDB_DSI_Type*) &UDB->DSI[8])                                    /* 0x40346400 */
#define UDB_DSI9                                ((UDB_DSI_Type*) &UDB->DSI[9])                                    /* 0x40346480 */
#define UDB_DSI10                               ((UDB_DSI_Type*) &UDB->DSI[10])                                   /* 0x40346500 */
#define UDB_DSI11                               ((UDB_DSI_Type*) &UDB->DSI[11])                                   /* 0x40346580 */
#define UDB_PA0                                 ((UDB_PA_Type*) &UDB->PA[0])                                      /* 0x40347000 */
#define UDB_PA1                                 ((UDB_PA_Type*) &UDB->PA[1])                                      /* 0x40347040 */
#define UDB_PA2                                 ((UDB_PA_Type*) &UDB->PA[2])                                      /* 0x40347080 */
#define UDB_PA3                                 ((UDB_PA_Type*) &UDB->PA[3])                                      /* 0x403470C0 */
#define UDB_PA4                                 ((UDB_PA_Type*) &UDB->PA[4])                                      /* 0x40347100 */
#define UDB_PA5                                 ((UDB_PA_Type*) &UDB->PA[5])                                      /* 0x40347140 */
#define UDB_PA6                                 ((UDB_PA_Type*) &UDB->PA[6])                                      /* 0x40347180 */
#define UDB_PA7                                 ((UDB_PA_Type*) &UDB->PA[7])                                      /* 0x403471C0 */
#define UDB_PA8                                 ((UDB_PA_Type*) &UDB->PA[8])                                      /* 0x40347200 */
#define UDB_PA9                                 ((UDB_PA_Type*) &UDB->PA[9])                                      /* 0x40347240 */
#define UDB_PA10                                ((UDB_PA_Type*) &UDB->PA[10])                                     /* 0x40347280 */
#define UDB_PA11                                ((UDB_PA_Type*) &UDB->PA[11])                                     /* 0x403472C0 */
#define UDB_BCTL                                ((UDB_BCTL_Type*) &UDB->BCTL)                                     /* 0x40347800 */
#define UDB_UDBIF                               ((UDB_UDBIF_Type*) &UDB->UDBIF)                                   /* 0x40347900 */

